In [1]:
import pandas as pd 
path="D:\Coding\Listof_product_based_companies_final.xlsx"

<>:2: SyntaxWarning: invalid escape sequence '\C'
<>:2: SyntaxWarning: invalid escape sequence '\C'
C:\Users\hp\AppData\Local\Temp\ipykernel_3540\1493463254.py:2: SyntaxWarning: invalid escape sequence '\C'
  path="D:\Coding\Listof_product_based_companies_final.xlsx"

In [2]:
df = pd.read_excel(path)
df.head()

,Company Name,Type,Employee Count,Rating,Old
0,Chetu,Software Product,1k-5k Employees,3.3,24 years old
1,Adobe,Software Product,5k-10k Employees,4.1,42 years old
2,UKG,Software Product,1k-5k Employees,3.4,4 years old
3,Nucleus Software Exports,Software Product,1k-5k Employees,3.5,38 years old
4,Innovaccer,Software Product,1k-5k Employees,3.1,10 years old

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Company Name    344 non-null    object
 1   Type            344 non-null    object
 2   Employee Count  274 non-null    object
 3   Rating          344 non-null    float64
 4   Old             274 non-null    object
dtypes: float64(1), object(4)
memory usage: 13.6+ KB

In [14]:
non_null_column = ~df.isnull().any()
non_null_column

Company Name       True
Type               True
Employee Count    False
Rating             True
Old               False
dtype: bool

In [18]:
df.loc[:,non_null_column]

                 Company Name               Type  Rating
0                       Chetu  Software Product      3.3
1                       Adobe  Software Product      4.1
2                         UKG  Software Product      3.4
3    Nucleus Software Exports  Software Product      3.5
4                  Innovaccer  Software Product      3.1
..                        ...                ...     ...
339         Bravura Solutions  Software Product      3.9
340                   Goodera  Software Product      2.9
341              KDK Software  Software Product      3.2
342                     AVEVA  Software Product      4.3
343                       PTC  Software Product      4.2

[344 rows x 3 columns]

In [22]:
for index, row in df.iterrows():
    print(f"Index: {index}, Company Name: {row['Company Name']}")
    break

Index: 0, Company Name: Chetu

In [32]:
df.iloc[:5,0:]

,Company Name,Type,Employee Count,Rating,Old
0,Chetu,Software Product,1k-5k Employees,3.3,24 years old
1,Adobe,Software Product,5k-10k Employees,4.1,42 years old
2,UKG,Software Product,1k-5k Employees,3.4,4 years old
3,Nucleus Software Exports,Software Product,1k-5k Employees,3.5,38 years old
4,Innovaccer,Software Product,1k-5k Employees,3.1,10 years old